############## if为：假 ################
if False:
    print("False 为：假")

if None:
    print("None 也是为：假")

if 0:
    print("数字0 也是为：假")

if "":
    print("空值  也是为：假")

if []:
    print("空的列表 也是为：假")

if {}:
    print("空的字典 也是为：假")

if ():
    print("空的元组 也是为：假")


############## if为：真 ################
if True:
    print("False 为：真")

if 1:
    print("非0数字 也是为：真")

if "2":
    print("非空值  也是为：真")

if [1,2]:
    print("非空的列表 也是为：真")

if {5,8}:
    print("非空的字典 也是为：真")

if (9,7):
    print("非空的元组 也是为：真")



############# 华丽的分割线 ##############
a = 11
b = 11
#b = 12  #for test

#判断两个值是否相等，相等为真，不相等为假
if a == b:
    print("判断两个值是否相等，相等为真，不相等为假")


#实际是判断id(a)和id(b)的值是否相同，相同为真，不同等为假
if a is b:
    print("实际是判断id(a)和id(b)的值是否相同，相同为真，不同等为假 a=%d, b=%d"%(id(a),id(b)))
else:
    print("实际是判断id(a)和id(b)的值是否相同，相同为真，不同等为假 a=%d, b=%d" % (id(a), id(b)))


